CircuitMess/Arduino-ESP8266/boards.txt
batctrl.name=BatController
batctrl.build.board=ESP8266_BATCTRL
batctrl.build.variant=nibble
batctrl.upload.tool=esptool
batctrl.upload.maximum_data_size=81920
batctrl.upload.wait_for_upload_port=false
batctrl.upload.erase_cmd=
batctrl.serial.disableDTR=true
batctrl.serial.disableRTS=true
batctrl.build.mcu=esp8266
batctrl.build.core=esp8266
batctrl.build.spiffs_pagesize=256
batctrl.build.debug_port=
batctrl.build.debug_level=
batctrl.menu.xtal.80=80 MHz
batctrl.menu.xtal.80.build.f_cpu=80000000L
batctrl.menu.xtal.160=160 MHz
batctrl.menu.xtal.160.build.f_cpu=160000000L
batctrl.menu.vt.flash=Flash
batctrl.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
batctrl.menu.vt.heap=Heap
batctrl.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
batctrl.menu.vt.iram=IRAM
batctrl.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
batctrl.menu.exception.legacy=Legacy (new can return nullptr)
batctrl.menu.exception.legacy.build.exception_flags=-fno-exceptions
batctrl.menu.exception.legacy.build.stdcpp_lib=-lstdc++
batctrl.menu.exception.disabled=Disabled (new can abort)
batctrl.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
batctrl.menu.exception.disabled.build.stdcpp_lib=-lstdc++
batctrl.menu.exception.enabled=Enabled
batctrl.menu.exception.enabled.build.exception_flags=-fexceptions
batctrl.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
batctrl.menu.ssl.all=All SSL ciphers (most compatible)
batctrl.menu.ssl.all.build.sslflags=
batctrl.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
batctrl.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
batctrl.upload.resetmethod=--before default_reset --after hard_reset
batctrl.build.flash_mode=qio
batctrl.build.flash_flags=-DFLASHMODE_QIO
batctrl.build.flash_freq=40
batctrl.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
batctrl.menu.eesz.4M2M.build.flash_size=4M
batctrl.menu.eesz.4M2M.build.flash_size_bytes=0x400000
batctrl.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
batctrl.menu.eesz.4M2M.build.spiffs_pagesize=256
batctrl.menu.eesz.4M2M.upload.maximum_size=1044464
batctrl.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
batctrl.menu.eesz.4M2M.build.spiffs_start=0x200000
batctrl.menu.eesz.4M2M.build.spiffs_end=0x3FA000
batctrl.menu.eesz.4M2M.build.spiffs_blocksize=8192
batctrl.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
batctrl.menu.eesz.4M3M.build.flash_size=4M
batctrl.menu.eesz.4M3M.build.flash_size_bytes=0x400000
batctrl.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
batctrl.menu.eesz.4M3M.build.spiffs_pagesize=256
batctrl.menu.eesz.4M3M.upload.maximum_size=1044464
batctrl.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
batctrl.menu.eesz.4M3M.build.spiffs_start=0x100000
batctrl.menu.eesz.4M3M.build.spiffs_end=0x3FA000
batctrl.menu.eesz.4M3M.build.spiffs_blocksize=8192
batctrl.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
batctrl.menu.eesz.4M1M.build.flash_size=4M
batctrl.menu.eesz.4M1M.build.flash_size_bytes=0x400000
batctrl.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
batctrl.menu.eesz.4M1M.build.spiffs_pagesize=256
batctrl.menu.eesz.4M1M.upload.maximum_size=1044464
batctrl.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
batctrl.menu.eesz.4M1M.build.spiffs_start=0x300000
batctrl.menu.eesz.4M1M.build.spiffs_end=0x3FA000
batctrl.menu.eesz.4M1M.build.spiffs_blocksize=8192
batctrl.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
batctrl.menu.eesz.4M.build.flash_size=4M
batctrl.menu.eesz.4M.build.flash_size_bytes=0x400000
batctrl.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
batctrl.menu.eesz.4M.build.spiffs_pagesize=256
batctrl.menu.eesz.4M.upload.maximum_size=1044464
batctrl.menu.eesz.4M.build.rfcal_addr=0x3FC000
batctrl.menu.ip.lm2f=v2 Lower Memory
batctrl.menu.ip.lm2f.build.lwip_include=lwip2/include
batctrl.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
batctrl.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
batctrl.menu.ip.hb2f=v2 Higher Bandwidth
batctrl.menu.ip.hb2f.build.lwip_include=lwip2/include
batctrl.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
batctrl.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
batctrl.menu.ip.lm2n=v2 Lower Memory (no features)
batctrl.menu.ip.lm2n.build.lwip_include=lwip2/include
batctrl.menu.ip.lm2n.build.lwip_lib=-llwip2-536
batctrl.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
batctrl.menu.ip.hb2n=v2 Higher Bandwidth (no features)
batctrl.menu.ip.hb2n.build.lwip_include=lwip2/include
batctrl.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
batctrl.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
batctrl.menu.ip.lm6f=v2 IPv6 Lower Memory
batctrl.menu.ip.lm6f.build.lwip_include=lwip2/include
batctrl.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
batctrl.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
batctrl.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
batctrl.menu.ip.hb6f.build.lwip_include=lwip2/include
batctrl.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
batctrl.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
batctrl.menu.ip.hb1=v1.4 Higher Bandwidth
batctrl.menu.ip.hb1.build.lwip_lib=-llwip_gcc
batctrl.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
batctrl.menu.ip.src=v1.4 Compile from source
batctrl.menu.ip.src.build.lwip_lib=-llwip_src
batctrl.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
batctrl.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
batctrl.menu.dbg.Disabled=Disabled
batctrl.menu.dbg.Disabled.build.debug_port=
batctrl.menu.dbg.Serial=Serial
batctrl.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
batctrl.menu.dbg.Serial1=Serial1
batctrl.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
batctrl.menu.lvl.None____=None
batctrl.menu.lvl.None____.build.debug_level=
batctrl.menu.lvl.SSL=SSL
batctrl.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
batctrl.menu.lvl.TLS_MEM=TLS_MEM
batctrl.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
batctrl.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
batctrl.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
batctrl.menu.lvl.HTTP_SERVER=HTTP_SERVER
batctrl.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
batctrl.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
batctrl.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
batctrl.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
batctrl.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
batctrl.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
batctrl.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
batctrl.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
batctrl.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
batctrl.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
batctrl.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
batctrl.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
batctrl.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
batctrl.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
batctrl.menu.lvl.CORE=CORE
batctrl.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
batctrl.menu.lvl.WIFI=
batctrl.menu.lvl.WIFI.build.debug_level=
batctrl.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
batctrl.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
batctrl.menu.lvl.UPDATER=UPDATER
batctrl.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
batctrl.menu.lvl.OTA=OTA
batctrl.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
batctrl.menu.lvl.OOM=OOM
batctrl.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
batctrl.menu.lvl.MDNS=MDNS
batctrl.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
batctrl.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+UPDATER+OTA+OOM+MDNS
batctrl.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+UPDATER+OTA+OOM+MDNS
batctrl.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
batctrl.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
batctrl.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
batctrl.menu.wipe.none=Only Sketch
batctrl.menu.wipe.none.upload.erase_cmd=
batctrl.menu.wipe.sdk=Sketch + WiFi Settings
batctrl.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
batctrl.menu.wipe.all=All Flash Contents
batctrl.menu.wipe.all.upload.erase_cmd=erase_flash
batctrl.menu.baud.115200=115200
batctrl.menu.baud.115200.upload.speed=115200
batctrl.menu.baud.57600=57600
batctrl.menu.baud.57600.upload.speed=57600
batctrl.menu.baud.230400.linux=230400
batctrl.menu.baud.230400.macosx=230400
batctrl.menu.baud.230400.upload.speed=230400
batctrl.menu.baud.256000.windows=256000
batctrl.menu.baud.256000.upload.speed=256000
batctrl.menu.baud.460800.linux=460800
batctrl.menu.baud.460800.macosx=460800
batctrl.menu.baud.460800.upload.speed=460800
batctrl.menu.baud.512000.windows=512000
batctrl.menu.baud.512000.upload.speed=512000
batctrl.menu.baud.921600=921600
batctrl.menu.baud.921600.upload.speed=921600
batctrl.menu.baud.3000000=3000000
batctrl.menu.baud.3000000.upload.speed=3000000

batctrl.build.defines=-DCIRCUITOS_LITTLEFS -DCIRCUITOS_TONE -DCIRCUITOS_LOWRAM -DST7735_DRIVER -DTFT_WIDTH=128 -DTFT_HEIGHT=160 -DTFT_RGB_ORDER=TFT_BGR -DTFT_MOSI=13 -DTFT_SCLK=14 -DTFT_MISO=-1 -DTFT_CS=-1 -DTFT_DC=2 -DTFT_RST=16 -DSPI_FREQUENCY=27000000
batctrl.build.extra_flags=-Os -g

# batctrl.bootloader.tool=firmburn
# batctrl.bootloader.tool.firmware=nibble/nibble-v1.0.0.bin

